Autodesk.Revit.DB.Structure.EndTreatmentType.CreateDefaultEndTreatmentType(Autodesk.Revit.DB.Document)
Creates a new EndTreatmentType object with a default name.
ADoc:
The document.
Returns:
The newly created type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.EndTreatmentType.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new EndTreatmentType in a document and adds the input string to the endTreatment parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.EndTreatmentType.Create(Autodesk.Revit.DB.Document)
Creates a new EndTreatmentType in a document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.EndTreatmentType.EndTreatment
String describing the end treatment
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.EndTreatmentType
An end treatment type object that is used to hold information about the end treatment applied to bars that are connected to a coupler.
Since:
2017